[
    {
        "_id": "5b16b4df058afb00149c56c2",
        "name": "Spicy Salmon With Bok Choy and Rice",
        "description": "<p>We would like to recommend you below recipe based on the available ingredients in your fridge!</p>\n\n<h3>Spicy Salmon With Bok Choy and Rice</h3>\n\n<p>As satisfying as take-out, but much healthier—and ready in 20 minutes. Our recipe for Spicy Salmon with Bok Choy and Rice couldn’t be easier. Versatile salmon fillets, the most commonly used cut of the fish, cook quickly in the oven. While you boil the rice, whip up a quick glaze for the salmon before throwing it under the broiler for a few minutes. Look for baby bok choy in specialty Asian markets if your grocery store doesn’t carry the vegetable. Our perfectly cooked fish, basted in a sweet-and-spicy honey-chile sauce, proves the ideal complement to steamed bok choy and long-grain rice.</p>\n\n<h3>Steps</h3>\n\n<ol>\n <li>Cook the rice according to the package directions.</li>\n <li>Meanwhile, combine the honey, soy sauce, and red pepper. On a foil-lined rimmed baking sheet, broil the salmon fillets until opaque throughout, 8 to 10 minutes, basting with the honey mixture during the last 3 minutes.</li>\n <li>Steam baby bok choy (cut into quarters) until tender, 8 to 10 minutes. Serve with the salmon and rice.</li>\n</ol>\n\n<p>We hope you enjoy the food!</p>\n\n<p>\n Regards, <br>\n Smart Fridge\n</p>",
        "ingredients": "salmon, bok choy"
    },
    {
        "_id": "5b16b4df058afb00149c56c3",
        "name": "Southwestern Beef Chili With Corn",
        "description": "<p>We would like to recommend you below recipe based on the available ingredients in your fridge!</p>\n\n<h3>Southwestern Beef Chili With Corn</h3>\n\n<p>Packed with flavor but not too spicy, this chili gets its southwestern flare from poblano peppers and chili powder. After cooking a base of onion, carrots, and peppers, you’ll brown the meat and stir in beans, tomato paste, and more. Serve the chili on its own, with hot sauce at the table, or with tortilla chips or a dollop of sour cream. Another plus: Our Southwestern Beef Chili with Corn freezes well. Double or even triple the recipe when you cook, then freeze the extra servings in separate containers to thaw and enjoy later in the season; on a cold, busy night, your future self will thank you.</p>\n\n<h3>Steps</h3>\n\n<ol>\n  <li>Heat the oil in a large saucepan over medium-high heat. Add the carrots, onion, and poblano and cook, stirring, for 3 minutes.</li>\n <li>Add the beef and cook, breaking it up with a spoon, until no longer pink, 3 to 5 minutes.</li>\n <li>Add the tomato paste and cook, stirring, until it is slightly darkened, 1 minute.</li>\n <li>Stir in the beans, chili powder, 3 cups water, ½ teaspoon salt, and ¼ teaspoon pepper.</li>\n <li>Simmer over medium heat until the vegetables are tender, 8 to 10 minutes. Stir in the corn.</li>\n <li>Divide the chili among bowls and top with the Cheddar and scallions.</li>\n</ol>\n\n<p>We hope you enjoy the food!</p>\n\n<p>\n Regards, <br>\n Smart Fridge\n</p>",
        "ingredients": "beef, onion, bell pepper, carrot, corn"
    },
    {
        "_id": "5b16b4df058afb00149c56c5",
        "name": "Quick Spring Lamb and Vegetable Stew",
        "description": "<p>We would like to recommend you below recipe based on the available ingredients in your fridge!</p>\n\n<h3>Quick Spring Lamb and Vegetable Stew</h3>\n\n<p>Hearty, satisfying, and warming, this lamb and vegetable stew is prepared in a single large pot. First, you’ll cut the lamb steaks into small pieces and brown the meat, then transfer it to a plate. Next, you’ll cook the carrots and onion, before adding a tablespoon of flour, which helps to thicken the brothy stew as it cooks. Simmer the remaining ingredients for about 10 minutes more, stir it all together, and you’re done. Since our recipe boasts carrots, green beans, and tomatoes, you won’t feel guilty about this all-in-one meal. On a chilly night, it’s the ideal simple supper.</p>\n\n<h3>Steps</h3>\n\n<ol>\n<li>Heat 1 tablespoon of the oil in a large pot over medium-high heat. Season the lamb with 1/2 teaspoon each salt and pepper. Cook, turning occasionally, until medium-rare, 6 to 8 minutes; transfer to a plate.</li>\n<li>Add the carrots, onion, and the remaining oil to the pot. Cook until beginning to soften, 3 to 4 minutes. Add the flour and cook for 1 minute. Add the wine and scrape up any brown bits.</li>\n<li>Add the broth, tomatoes, and beans. Simmer until the vegetables are tender, 8 to 10 minutes. Stir in the lamb, parsley, 1/2 teaspoon salt, and 1/4 teaspoon pepper. Serve immediately.</li>\n<li>To freeze: Cool the stew to room temperature and spoon into a freezer container or bag. Freeze for up to 3 months. To cook, thaw the stew in a bowl of cold water or overnight in the refrigerator. Transfer to a pot and cook, covered, stirring occasionally, until heated through, 10 to 20 minutes.</li>\n</ol>\n\n<p>We hope you enjoy the food!</p>\n\n<p>\n Regards, <br>\n Smart Fridge\n</p>",
        "ingredients": "chicken, tomato, parsley, green beans, lamb, carrot"
    },
    {
        "_id": "5b16b4df058afb00149c56c4",
        "name": "Crispy Pork Cutlets With Fennel-Chickpea Slaw",
        "description": "<p>We would like to recommend you below recipe based on the available ingredients in your fridge!</p>\n\n<h3>Crispy Pork Cutlets With Fennel-Chickpea Slaw</h3>\n\n<p>Don’t let the five-step procedure or the somewhat lengthy ingredient list fool you. Our Crispy Pork Cutlets With Fennel-Chickpea Slaw really do come together in half an hour. And, better yet, they don’t fall back on store-bought short cuts. With just a food processor and some sliced bread, you can make homemade bread crumbs, which will create the crunchy exterior for your “oven-fried” pork. If you can’t locate pork cutlets, place pork steaks on a cutting board. Hold the piece of meat flat with the palm of your hand and carefully slice it in half horizontally. Use a meat tenderizer to flatten the cutlets further, if desired.</p>\n\n<h3>Steps</h3>\n\n<ol>\n <li>Heat oven to 425° F. Place an oven-proof wire rack set in a baking sheet. Pulse the bread until fine crumbs form in a food processor (you should have about 2½ cups). Add 1 tablespoon of the oil, ½ teaspoon salt, and ¼ teaspoon pepper and pulse once or twice to moisten.</li>\n<li>Spread the bread crumbs on a rimmed baking sheet and bake, tossing once, until golden brown, 4 to 6 minutes. Let cool and transfer to a shallow bowl.</li>\n<li>Place the flour in a second shallow bowl. Beat the egg whites with 1 tablespoon water in a third shallow bowl.</li>\n<li>Season the pork with ½ teaspoon salt and ¼ teaspoon pepper. Coat with the flour (tapping off any excess), dip in the egg whites (shaking off any excess), then coat with the bread crumbs (pressing gently to help them adhere). Place on the prepared pan and bake until cooked through, 8 to 10 minutes.</li>\n<li>Meanwhile, toss together the chickpeas, fennel, celery stalks and leaves, onion, lemon juice, the remaining 2 tablespoons of oil, ½ teaspoon salt, and ¼ teaspoon pepper in a medium bowl. Serve over the pork with the lemon wedges.</li>\n</ol>\n\n<p>We hope you enjoy the food!</p>\n\n<p>\n Regards, <br>\n Smart Fridge\n</p>",
        "ingredients": "pork, egg, chickpeas, fennel, red onion, lemon"
    },
    {
        "_id": "5b16b4df058afb00149c56c6",
        "name": "Steak With Roasted Parsnips and Tomatoes",
        "description": "<p>We would like to recommend you below recipe based on the available ingredients in your fridge!</p>\n\n<h3>Steak With Roasted Parsnips and Tomatoes</h3>\n\n<p>Simple enough to make for just two or four, but impressive enough to serve at a dinner party. This two-part meal appears, on its surface, to be much more involved than what the recipe actually requires. The vegetables, tossed with oil, herbs, salt, and pepper, roast in the oven at a high temperature, while you quickly sear the steaks over the stovetop. Serve the meat along your roasted vegetables, and add a green salad, if you’d like, for a delicious, protein-packed (and low-carb) supper. And the roasting trick works for any root vegetable; try it with potatoes, carrots, or beets for a twist.</p>\n\n<h3>Steps</h3>\n\n<ol>\n<li>Heat oven to 450° F. Toss the parsnips, tomatoes, scallions, thyme, ¼ cup of the oil, and ¼ teaspoon each salt and pepper in a 9-by-13-inch baking dish.</li>\n\n<li>Cover the dish with foil and roast until the juices are bubbling, 15 to 20 minutes. Remove the foil and continue to roast until the parsnips are tender, 10 to 15 minutes more.</li>\n\n<li>Meanwhile, heat the remaining teaspoon of oil in a large skillet over medium-high heat. Season the steaks with ½ teaspoon each salt and pepper., Cook, in batches, until an instant-read thermometer inserted in the center of each piece registers 130° F, 2 to 3 minutes per side for medium-rare.</li>\n\n<li>Let the steaks rest for at least 5 minutes before slicing. Serve with the vegetables.</li>\n</ol>\n\n<p>We hope you enjoy the food!</p>\n\n<p>\n Regards, <br>\n Smart Fridge\n</p>",
        "ingredients": "steak, thyme, scallion, cherry tomato, parsnip"
    }
]